chess.org
#+TITLE: Chess Programming
#+INDEX: Chess Programming

* Idea
Build a simple chess programming application in Go using UI library. Give ability to do networked play using Pion. 

* Links
- [[https://nanochess.org/knight.html][Nanochess]]
- [[https://www.freecodecamp.org/news/simple-chess-ai-step-by-step-1d55a9266977/][A step-by-step guide to building a simple chess AI]]
- [[https://www.gamedev.net/tutorials/_/technical/artificial-intelligence/chess-programming-part-ii-data-structures-r1046/][Chess Programming Part II: Data Structures]]
- [[http://archive.gamedev.net/archive/reference/articles/article1014.html][Chess Programming Part I: Getting Started]]
- [[http://www.fam-petzke.de/cp_board_en.shtml][The Chess Board]]
- [[http://archive.computerhistory.org/projects/chess/related_materials/text/2-0%20and%202-1.Programming_a_computer_for_playing_chess.shannon/2-0%20and%202-1.Programming_a_computer_for_playing_chess.shannon.062303002.pdf][Programming a Computer for Playing Chess]]
- [[http://archive.computerhistory.org/projects/chess/related_materials/text/4-4.First_Steps.Byte_Magazine/First_Steps_in_Computer_Chess_Programing.Spracklen-Dan_Kathe.Byte_Magazine.Oct-1978.062303035.sm.pdf][First Steps in Computer Chess Programming]]
- [[http://www.doiserbia.nb.rs/img/doi/0354-0243/2012/0354-02431200011V.pdf][An Alternative Efficient Chessboard Representation Based on 4-BIT Piece Coding]]
- [[https://zserge.com/posts/carnatus/][Let's Write A Tiny Chess Engine in Go]]
- [[https://home.hccnet.nl/h.g.muller/ep.html][Move Generation: En Passant]]
- [[https://github.com/thomasahle/sunfish/blob/master/sunfish.py][SunFish]]
