docs/chess.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-05-18 Tue 17:16 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Chess Programming</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="/static/css/org.css">
</head>
<body>
<div id="preamble" class="status">
<a href="/">Home</a>
</div>
<div id="content">
<header>
<h1 class="title">Chess Programming</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfe37b5a">1. Idea</a></li>
<li><a href="#org2f5249b">2. Links</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgfe37b5a" class="outline-2">
<h2 id="orgfe37b5a"><span class="section-number-2">1</span> Idea</h2>
<div class="outline-text-2" id="text-1">
<p>
Build a simple chess programming application in Go using UI library. Give ability to do networked play using Pion. 
</p>
</div>
</div>

<div id="outline-container-org2f5249b" class="outline-2">
<h2 id="org2f5249b"><span class="section-number-2">2</span> Links</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="https://nanochess.org/knight.html">Nanochess</a></li>
<li><a href="https://www.freecodecamp.org/news/simple-chess-ai-step-by-step-1d55a9266977/">A step-by-step guide to building a simple chess AI</a></li>
<li><a href="https://www.gamedev.net/tutorials/_/technical/artificial-intelligence/chess-programming-part-ii-data-structures-r1046/">Chess Programming Part II: Data Structures</a></li>
<li><a href="http://archive.gamedev.net/archive/reference/articles/article1014.html">Chess Programming Part I: Getting Started</a></li>
<li><a href="http://www.fam-petzke.de/cp_board_en.shtml">The Chess Board</a></li>
<li><a href="http://archive.computerhistory.org/projects/chess/related_materials/text/2-0%20and%202-1.Programming_a_computer_for_playing_chess.shannon/2-0%20and%202-1.Programming_a_computer_for_playing_chess.shannon.062303002.pdf">Programming a Computer for Playing Chess</a></li>
<li><a href="http://archive.computerhistory.org/projects/chess/related_materials/text/4-4.First_Steps.Byte_Magazine/First_Steps_in_Computer_Chess_Programing.Spracklen-Dan_Kathe.Byte_Magazine.Oct-1978.062303035.sm.pdf">First Steps in Computer Chess Programming</a></li>
<li><a href="http://www.doiserbia.nb.rs/img/doi/0354-0243/2012/0354-02431200011V.pdf">An Alternative Efficient Chessboard Representation Based on 4-BIT Piece Coding</a></li>
<li><a href="https://zserge.com/posts/carnatus/">Let's Write A Tiny Chess Engine in Go</a></li>
<li><a href="https://home.hccnet.nl/h.g.muller/ep.html">Move Generation: En Passant</a></li>
<li><a href="https://github.com/thomasahle/sunfish/blob/master/sunfish.py">SunFish</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-05-18 Tue 17:16</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
